results/runs/ycsb/2026-05-10T13-11-53/mongodb/load_workload_d.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p threadcount=10 -p mongodb.upsert=true -p core_workload_insertion_retry_limit=10
Command line: -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p threadcount=10 -p mongodb.upsert=true -p core_workload_insertion_retry_limit=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-10 13:10:40:306 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongodb:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-10 13:10:50:276 10 sec: 99004 operations; 9900.4 current ops/sec; est completion in 1 second [CLEANUP: Count=1, Max=12, Min=12, Avg=12, 90=12, 99=12, 99.9=12, 99.99=12] [INSERT: Count=99102, Max=342271, Min=220, Avg=961.14, 90=1479, 99=6279, 99.9=19967, 99.99=51711] 
2026-05-10 13:10:50:432 10 sec: 100000 operations; 6343.95 current ops/sec; [CLEANUP: Count=9, Max=6235, Min=1, Avg=694.44, 90=3, 99=6235, 99.9=6235, 99.99=6235] [INSERT: Count=898, Max=10943, Min=235, Avg=791.56, 90=1290, 99=7331, 99.9=10279, 99.99=10943] 
[OVERALL], RunTime(ms), 10157
[OVERALL], Throughput(ops/sec), 9845.426799251747
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 247
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.431820419415182
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 247
[TOTAL_GC_TIME_%], Time(%), 2.431820419415182
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 626.2
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 6235
[CLEANUP], 95thPercentileLatency(us), 6235
[CLEANUP], 99thPercentileLatency(us), 6235
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 959.61627
[INSERT], MinLatency(us), 220
[INSERT], MaxLatency(us), 342271
[INSERT], 95thPercentileLatency(us), 2247
[INSERT], 99thPercentileLatency(us), 6283
[INSERT], Return=OK, 100000